In [1]:
import pandas as pd

In [8]:
Data = {
    'FirstName' : ['Aryan','Rohan','Riya','Yash','Siddhant'],
    'LastName' : ['Singh','Agarwal','Shah','Bhatia','Khanna'],
    'Type' : ['Full-Time Employee','Intern','Full-Time Employee','Part-Time Employee','Full-Time Employee'],
    'Department' : ['Administration','Technical','Administration','Technical','Management'],
    'YoE' : [2,3,5,7,6],
    'Salary' : [20000,5000,10000,10000,20000]
}
employee_df = pd.DataFrame(Data)
print(df)

  FirstName LastName                Type      Department  YoE  Salary
0     Aryan    Singh  Full-Time Employee  Administration    2   20000
1     Rohan  Agarwal              Intern       Technical    3    5000
2      Riya     Shah  Full-Time Employee  Administration    5   10000
3      Yash   Bhatia  Part-Time Employee       Technical    7   10000
4  Siddhant   Khanna  Full-Time Employee      Management    6   20000

In [9]:
table = pd.pivot_table(employee_df,index = ['Type','Department'],values = 'Salary',aggfunc ='mean')
table

                                   Salary
Type               Department
Full-Time Employee Administration   15000
                   Management       20000
Intern             Technical         5000
Part-Time Employee Technical        10000

In [10]:
pivot = pd.pivot_table(
data = df,
index = 'Type',
values = 'Salary',
aggfunc = ['mean','sum']
)
print(pivot)

                            mean    sum
                          Salary Salary
Type
Full-Time Employee  16666.666667  50000
Intern               5000.000000   5000
Part-Time Employee  10000.000000  10000

In [13]:
employee_df.pivot_table(index = 'Type',values = 'Salary',aggfunc ='count')

                    Salary
Type
Full-Time Employee       3
Intern                   1
Part-Time Employee       1